## day01
import torch
# - 1.使用torch.tensor()、torch.arange()和torch.randn()分别创建一个形状为(3, 4)的张量，并打印。
t1 = torch.tensor([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print(t1)
print('---------------------------------------------------------------------------------------------------------')
t2 = torch.arange(1,13).reshape(3,4)
print(t2)
print('---------------------------------------------------------------------------------------------------------')
t3 = torch.randn(3,4)
print(t3)
print('---------------------------------------------------------------------------------------------------------')
# - 2.创建一个形状为(5,10)的全0张量 和 全1张量，并打印。
t4 = torch.zeros(5,10)
print(t4)
print('---------------------------------------------------------------------------------------------------------')
t5 = torch.ones(5,10)
print(t5)
# - 3.使用torch.randint()创建一个形状为(3, 4)的随机整数张量,并将元素类型转换为torch.float32，并打印。
t6 = torch.randint(0,10,(3,4))
print(t6)
print('---------------------------------------------------------------------------------------------------------')
t7 = t6.to(torch.float32)
print(t7)
# - 4.使用torch.rand()创建一个形状为(3, 4)的张量，然后转换为numpy数组，然后更改其中的一个元素为42，然后再转换为张量，并打印。
t8 = torch.rand(3,4)
t8_numpy = t8.numpy()
t8_numpy[0,0] = 42
t8_torch = torch.from_numpy(t8_numpy)
print(t8_torch)
# - 5.创建一个标量张量，并转换为 python数值，并打印。
t9 = torch.tensor(42)
print(t9.item())